/******************************************************************************
 * クラスIntStack
 * 
 * int型データを保持するスタック
 *****************************************************************************/
public class IntStack{
    
    private final int SIZE = 20;          //スタックサイズ
    private int[] stack = new int[SIZE];  //データ格納用配列
    private int count = 0;                //格納データ数
    
    /**************************************************************************
     * スタックに新たなint型データを積む
     * 
     * 引数 : dat 積むデータ
     * 戻値 : datを積んだ後のデータ数 (スタック満杯で積めなかった場合は-1)
     *************************************************************************/
    public int push(int dat){
        //スタック内のデータ数チェック
        if(count >= SIZE){
            return -1;
        }
        //スタックにデータを積む
        stack[count] = dat;
        count++;
        return count;
    }
    
    /**************************************************************************
     * スタックからint型データを取り出す
     * 
     * 引数 : なし
     * 戻値 : 取り出したデータ (スタックが空だった場合はint型最小値)
     *************************************************************************/
    public int pop(){
        //スタック内のデータ数チェック
        if(count <= 0){
            return Integer.MIN_VALUE;
        }
        //スタックからデータを取り出す
        count--;
        return stack[count];
    }
    
    /**************************************************************************
     * スタックから次に取り出されるデータを得る
     * スタックからは取り出さず、データのコピーが得られる
     * 
     * 引数 : なし
     * 戻値 : 得られたデータ (スタックが空だった場合はint型最小値)
     *************************************************************************/
    public int get(){
        //スタック内のデータ数チェック
        if(count <= 0){
            return Integer.MIN_VALUE;
        }
        //スタックの最上のデータを返す
        return stack[count - 1];
    }
    
    /**************************************************************************
     * スタックに積まれているデータ数を得る
     * 
     * 引数 : なし
     * 戻値 : スタック内のデータ数
     *************************************************************************/
    public int getCount(){
        return count;
    }
    
    /**************************************************************************
     * スタックのデータを全て削除する
     * 
     * 引数 : なし
     * 戻値 : なし
     *************************************************************************/
    public void clear(){
        count = 0;
    }
}
