/******************************************************************************
 * サブルーチンとしてのメソッド ～ 素因数分解
 * ある整数を素因数分解し、結果を文字列で返すメソッド
 *****************************************************************************/
public class Kadai1030{
    
    /**************************************************************************
     * メインメソッド
     *************************************************************************/
    public static void main(String[] args){
        //整数の入力
        int num = Keyboard.readInt("2以上の整数");
        //素因数分解の結果を表示
        System.out.println(decomposeIntoPrime(num));
    }
    
    /**************************************************************************
     * 整数を素因数分解する
     * 
     * 引数 : num 素因数分解する整数
     * 戻値 : 素因数分解の結果を表す文字列(分解不能の場合はnull)
     *************************************************************************/
    private static String decomposeIntoPrime(int num){
        //2未満は素因数分解出来ないので、nullを返す
        if(num < 2){
            return null;
        }
        
        //分解結果の先頭文字列のセット
        String result = num + " = ";
        boolean x = false;
        
        //最小の素数2から順に、その素数で何回割れるかを求める
        int prime = 2;
        //  numを素数で割った値が1になるまで繰り返し
        while(num != 1){
            //現在の素数で何回割れるかを数える
            int cnt = 0;
            while(num % prime == 0){
                cnt++;
                num /= prime;
            }
            //1回以上割れたなら、表示文字列に素数と割れた数を追加
            if(cnt != 0){
                if(x){
                    result += " × ";
                }else{
                    x = true;
                }
                result += prime + " ^ " + cnt;
            }
            //次の素数を求める
            prime = nextPrime(prime);
        }
        
        //最終的に組上げられた素因数分解の結果を返す
        return result;
    }
    
    /**************************************************************************
     * ある整数より大きい素数のうち、最小のものを求める
     * 
     * 引数 : num 整数
     * 戻値 : numより大きい素数のうちで最小のもの
     *************************************************************************/
    private static int nextPrime(int num){
        //numが2未満なら、求める素数は2
        if(num < 2){
            return 2;
        }
        //numが2なら、求める素数は3
        if(num < 3){
            return 3;
        }
        
        //numより大きい奇数のうち、最小のものを計算
        num = num + 1 + num % 2;
        
        //numを2ずつ加算(常に奇数となる)しながら、numが素数か非素数かを判定
        while(!isPrime(num)){
            num += 2;
        }
        
        //最初に素数として判定されたものを返す
        return num;
    }
    
    /**************************************************************************
     * 整数が素数か非素数かを調べる
     * 
     * 引数 : num 素数か非素数かを調べる整数
     * 戻値 : true 素数, false 非素数
     *************************************************************************/
    private static boolean isPrime(int num){
        //整数が2未満は非素数
        if(num < 2){
            return false;
        }
        
        //素数か非素数かを調べる
        boolean prime = true;
        if(num != 2 && num % 2 == 0){
            //整数が偶数なら非素数
            prime = false;
        }else{
            //整数が奇数の場合は、3～整数の平方根までの奇数のうち、
            //割り切れる数があれば非素数
            int max = (int)(Math.sqrt((double)num)) + 1;
            for(int i = 3; i < max && prime; i += 2){
                if(num % i == 0){
                    prime = false;
                }
            }
        }
        
        //最終的に、非素数でなければ素数である
        return prime;
    } 
}
