/*******************************************************************************
 * 問題を扱うクラス
 ******************************************************************************/
public abstract class Question{
    public static final int MIN = 1;             //問題に使う数の最小値
    public static final int MAX = 9;             //問題に使う数の最大値
    
    private Rank rank = new Rank(null);          //ランキング
    
    /***************************************************************************
     * 問題を作る
     *
     * 引　数：なし
     * 戻り値：なし
     * その他：a,bを更新する
     **************************************************************************/
    public abstract void makeQuestion();
    
    /***************************************************************************
     * 問題を表示する
     *
     * 引　数：i 問題番号(0から開始)
     * 戻り値：なし
     * その他：なし
     **************************************************************************/
    public abstract void showQuestion(int i);
    
    /***************************************************************************
     * 正誤を判定する
     *
     * 引　数：ans 回答値
     * 戻り値：正誤(正:1, 誤:0)
     * その他：
     **************************************************************************/
    public abstract int judge(int ans);
    
    /***************************************************************************
     * ランクイン処理をする
     *
     * 引　数：score 得点
     * 戻り値：なし
     * その他：ランキング配列を更新する
     **************************************************************************/
    public void ranking(int score){
        rank.ranking(score);
    }
    
    /***************************************************************************
     * ランキングを表示する
     *
     * 引　数：なし
     * 戻り値：なし
     * その他：なし
     **************************************************************************/
    public void showRanking(){
        rank.showRanking();
    }
    
    /***************************************************************************
     * ランキング名を設定する
     *
     * 引　数：name ランキング名
     * 戻り値：なし
     * その他：なし
     **************************************************************************/
    public void setRanking(String name){
        rank = new Rank(name);
    }
}
