/******************************************************************************
 * クラスCheapHand
 * 　安易な手を出すじゃんけんの手
 * 　出す手は全くの乱数で決定する。
 ******************************************************************************/
#include "CheapHand.h"
#include "Saikoro.h"

/******************************************************************************
 * コンストラクタ
 * 　手の決定に利用するサイコロオブジェクトを作成する
 * 引数：なし
 ******************************************************************************/
CheapHand::CheapHand(){
	sai = new Saikoro(TE_NUM);
}

/******************************************************************************
 * デストラクタ
 * 　サイコロオブジェクトを解放する
 * 引数：なし
 ******************************************************************************/
CheapHand::~CheapHand(){
	delete sai;
}

/******************************************************************************
 * 関数decideType()
 * 　出す手を決定する
 * 引数：なし
 * 戻値：int 決定した手(GUH,CHO,PAH)
 ******************************************************************************/
int CheapHand::decideType(){
	int s = sai->throwSaikoro();	//サイコロを振って決定
	switch(s){
		case 1:
			handType = GUH;
			break;
		case 2:
			handType = CHO;
			break;
		case 3:
			handType = PAH;
			break;
		default:
			handType = GUH;			//ここには来ないはず
			break;
	}
	return handType;
}

/******************************************************************************
 * 関数learnHand()
 * 　CheapHandにおいては、何もしない
 * 引数：なし
 * 戻値：なし
 ******************************************************************************/
void CheapHand::learnHand(Hand &preHand){
}