/******************************************************************************
 * クラスHand
 * 　じゃんけんの手を表す基底抽象クラス。
 * 　decideType()で自分の出す手を決定し、inputHand()で相手の手の情報を得、
 * 　自分が次に出す手の判断材料にする。
 ******************************************************************************/
#include "Hand.h"

/******************************************************************************
 * コンストラクタ
 * 　各種初期化し、勝負分クラスを作成する
 * 引数：なし
 ******************************************************************************/
Hand::Hand(){
	handType = NON;
	result = new Result();
}

/******************************************************************************
 * デストラクタ
 * 　勝負分クラスを削除する
 * 引数：なし
 ******************************************************************************/
Hand::~Hand(){
	delete result;
}

/******************************************************************************
 * 関数compareHand()
 * 　相手の手と自分の手とを比較し、勝敗を判別する
 * 引数：Hand &mate ： 比較対照となる手
 * 戻値：int : 勝敗(KATI,MAKE,AIKO)、判別不可の場合はNON
 ******************************************************************************/
int Hand::compareHand(Hand &mate){
	int mateType = mate.getType();
	if(mateType == NON){
		return NON;
	}
	
	//勝敗テーブル         相手 GUH   PAH   CHO
	int dat[TE_NUM][TE_NUM] = {{AIKO, MAKE, KATI},   //GUH 自分
	                           {KATI, AIKO, MAKE},   //PAH  ↓
	                           {MAKE, KATI, AIKO}};  //CHO
	
	int res = dat[handType][mateType];
	
	//勝敗分の記録
	switch(res){
		case KATI:
			result->win();
			break;
		case AIKO:
			result->draw();
			break;
		case MAKE:
			result->lose();
			break;
	}
	return res;
}

/******************************************************************************
 * 関数getType()
 * 　現在の手を得る
 * 引数：なし
 * 戻値：int : 現在の手(GUH,PAH,CHO)
 ******************************************************************************/
int Hand::getType(){
	return handType;
}

/******************************************************************************
 * 関数getWin()
 * 　現在の勝ち数を得る
 * 引数：なし
 * 戻値：int : 現在の勝ち数
 ******************************************************************************/
int Hand::getWin(){
	return result->getWin();
}

/******************************************************************************
 * 関数getLose()
 * 　現在の負け数を得る
 * 引数：なし
 * 戻値：int : 現在の負け数
 ******************************************************************************/
int Hand::getLose(){
	return result->getLose();
}

/******************************************************************************
 * 関数getDraw()
 * 　現在の引分け数を得る
 * 引数：なし
 * 戻値：int : 現在の引分け数
 ******************************************************************************/
int Hand::getDraw(){
	return result->getDraw();
}

/******************************************************************************
 * 関数getWinType()
 * 　指定した手に対する勝ち手を得る
 * 引数：int type : 指定する手(GUH,PAH,CHO)
 * 戻値：int : 指定した手に勝てる手(GUH,PAH,CHO)、指定した手が不正の場合はNON
 ******************************************************************************/
int Hand::getWinType(int type){
	if(type < 0 || type > TE_NUM){
		return NON;
	}
	return (type + 1) % TE_NUM;
}