/******************************************************************************
 * クラスSaikoro
 * 　最大値可変のサイコロ
 ******************************************************************************/

#include <ctime>
#include <iostream>
#include "Saikoro.h"
using namespace std;

/******************************************************************************
 * コンストラクタ
 * 　各種の初期化をし、サイコロを振る
 * 引数：int max : サイコロの目の最大値
 ******************************************************************************/
Saikoro::Saikoro(int max){
	srand((unsigned)time(NULL));	//乱数列初期化
	maxOrder = 6;					//最大値のデフォルト6
	if(max > 0){					//最大値は1以上
		maxOrder = max;
	}
	throwSaikoro();
}

/******************************************************************************
 * 関数throwSaikoro()
 * 　サイコロを振る
 * 引数：なし
 * 戻値：int 出たサイコロの目
 ******************************************************************************/
int Saikoro::throwSaikoro(){
	order = rand() % maxOrder + 1;
	return order;
}

/******************************************************************************
 * 関数getOrder()
 * 　サイコロの目を得る
 * 引数：なし
 * 戻値：int サイコロの目
 ******************************************************************************/
int Saikoro::getOrder(){
	return order;
}

/******************************************************************************
 * 関数getMax()
 * 　サイコロの目の最大値を得る
 * 引数：なし
 * 戻値：int サイコロの目の最大値
 ******************************************************************************/
int Saikoro::getMax(){
	return maxOrder;
}