/******************************************************************************
 * クラスUserHand
 * 　ユーザのじゃんけんの手
 * 　アプリケーションユーザの入力によって、手を決定する。
 ******************************************************************************/
#include <iostream>
#include "UserHand.h"
using namespace std;

/******************************************************************************
 * 関数decideType()
 * 　出す手を決定する
 * 　ユーザから直接入力して決定
 * 引数：なし
 * 戻値：int 出す手(GUH,PAH,CHO)
 ******************************************************************************/
int UserHand::decideType(){
	cout << "１．グー　２．チョキ　３．パー" << endl;
	cout << "１～３のどれかを入力してください。=> ";

	int comm = 0;					//入力用
	do{
		cin >> comm;
		cout << endl;

		switch(comm){				//入力によって手を変える
			case 1:
				handType = GUH;
				break;
			case 2:
				handType = CHO;
				break;
			case 3:
				handType = PAH;
				break;
			default:
				comm = 0;
				cout << "１～３のどれかを入力してください。=> ";
				break;
		}
	}while(comm == 0);

	return handType;
}

/******************************************************************************
 * 関数learnHand()
 * 　相手の直前の手を学習する
 * 　このクラスにおいては、特に何もしない。
 * 引数：Hand &preHand : 相手の直前の手
 * 戻値：なし
 ******************************************************************************/
void UserHand::learnHand(Hand &preHnad){
}