/*
  サイコロを表すクラス
*/
import java.util.ArrayList;
import java.util.Random;

public class Dice{
    //クラスフィールド
    private static ArrayList<Dice> list = new ArrayList<Dice>();  //サイコロの一覧
    
    //インスタンスフィールド
    private int eye;                                              //サイコロの目
    
    //----------------------------------------------------------------
    // コンストラクタ(newした時のインスタンス初期化処理)
    // 引数 : なし
    //----------------------------------------------------------------
    public Dice(){
        nextEye();
        list.add(this);
    }
    
    //インスタンスメソッド
    //----------------------------------------------------------------
    // 次の目に変える
    // 引数 : なし
    // 戻値 : 変わった後の目
    //----------------------------------------------------------------
    public int nextEye(){
        Random r = new Random();
        eye = r.nextInt(6) + 1;
        return eye;
    }
    
    //----------------------------------------------------------------
    // 各フィールドのゲッターメソッド
    //----------------------------------------------------------------
    public int getEye(){
        return eye;
    }
    
    //クラスメソッド
    //----------------------------------------------------------------
    // 丁半の当たり判定をする
    // 引数 : chohan 指定した丁半 0:丁 1:半
    // 戻値 : true:当たり, false:はずれ
    //----------------------------------------------------------------
    public static boolean judgeChoHan(int chohan){
        int sum = 0;
        for(Dice d : list){
            sum += d.getEye();
        }
        
        if(sum % 2 == chohan){
            return true;
        }
        return false;
    }
}
