/*
  勝敗を表すクラス
*/
public class WinLose{
    private int win;          //勝ち数
    private int lose;         //負け数
    
    //----------------------------------------------------------------
    // コンストラクタ(newしたときの初期化処理)
    // 引数 : なし
    //----------------------------------------------------------------
    public WinLose(){
        win = 0;      //ただし、数値フィールドは暗黙で0で初期化される
        lose = 0;
    }
    
    //----------------------------------------------------------------
    // 各フィールドのゲッターメソッド
    //----------------------------------------------------------------
    public int getWin(){
        return win;
    }
    
    public int getLose(){
        return lose;
    }
    
    //----------------------------------------------------------------
    // 勝敗カウント
    // 引数 : result true:勝ち, false:負け
    // 戻値 : なし
    //----------------------------------------------------------------
    public void countWinLose(boolean result){
        if(result){
            win++;
        }else{
            lose++;
        }
    }
}
