/******************************************************************************
 * クラス MathExp
 * 標準APIのMathクラスには無いメソッドの実装クラス
 *****************************************************************************/
public class MathExp{
    
    /**************************************************************************
     * 2つの整数の最大公約数(the greatest common divisor)を求める
     * 
     * 引数 : num1 整数1, num2 整数2
     * 戻値 : num1とnum2の最大公約数
     *************************************************************************/
    public static int gcd(int num1, int num2){
        //num1 >= num2となるように変数内容入れ替え
        if(num1 < num2){
            int w = num1;
            num1 = num2;
            num2 = w;
        }
        //ユークリッドの互除法により最大公約数を求める
        int c = 0;
        do{
            c = num1 % num2;
            num1 = num2;
            num2 = c;
        }while(c != 0);
        return num1;
    }
    
    /**************************************************************************
     * 整数が素数か非素数かを調べる
     * 
     * 引数 : num 素数か非素数かを調べる対象となる整数
     * 戻値 : true 素数, false 非素数
     *************************************************************************/
    public static boolean isPrime(int num){
        //2未満は非素数
        if(num < 2){
            return false;
        }
        //素数か非素数かを調べる
        boolean prime = true;
        if(num != 2 && num % 2 == 0){
            //2以外の偶数は非素数
            prime = false;
        }else{
            //3以上numの平方根以下の奇数でnumを割り切れるかを調べる
            int max = (int)(Math.sqrt((double)num)) + 1;
            for(int i = 3; i < max && prime; i += 2){
                if(num % i == 0){
                    //1つでも割り切れればnumは素数でない
                    prime = false;
                }
            }
            //どの奇数にも割り切られなければ、prime = falseの状態でループを出る
        }
        //結果を返す
        return prime;
    }
    
    /**************************************************************************
     * ある整数より大きい素数のうち、最小のものを求める
     * 
     * 引数 : num 整数
     * 戻値 : numより大きい素数のうち最小のもの
     *************************************************************************/
    public static int nextPrime(int num){
        //numが2未満の場合、最小の素数2を返す
        if(num < 2){
            return 2;
        }
        //numが2ならば、次の素数は3
        if(num < 3){
            return 3;
        }
        
        //numが3以上の場合は、ループで探す
        //素数は必ず奇数なので、まずはnumの次の奇数を求める
        num = num + 1 + num % 2;
        
        //奇数を順に増やしながら、その奇数が素数か非素数かを調べる
        while(!isPrime(num)){
            num += 2;
        }
        //素数なら、それをリターン
        return num;
    }
    
    /**************************************************************************
     * 整数を素因数分解する
     * 
     * 引数 : num 素因数分解する整数
     * 戻値 : 素因数分解の結果を格納した配列
     *        例えばnum=24なら、配列内容は{2, 3, 3, 1}。(24 = 2 ^ 3 * 3 ^ 1)
     *************************************************************************/
    public static int[] decomposeIntoPrime(int num){
        //素因数分解の結果を入れる配列。最初はサイズ0で生成。
        int[] result = new int[0];
        
        //最小の素数2から順に、numを割り切る素数を探す
        //numを素数で割り切って1になれば終了
        int prime = 2;
        while(num != 1){
            int cnt = 0;
            //割り切れる(剰余が0)のあいだ割ることを繰り返し、割れる数を数える
            while(num % prime == 0){
                cnt++;
                num /= prime;
            }
            //割った数が1以上ならば、結果配列に入れる
            if(cnt != 0){
                //割った素数と割った回数を入れるために、配列サイズを2増やす
                int[] work = new int[result.length + 2];
                for(int i = 0; i < result.length; i++){
                    work[i] = result[i];
                }
                result = work;
                //結果を配列に代入
                result[result.length - 2] = prime;
                result[result.length - 1] = cnt;
            }
            //次の素数を求め、繰り返し
            prime = nextPrime(prime);
        }
        //結果配列を返す
        return result;
    }
}
