package f_for;
/******************************************************************************
 * 極小の数値を加算する(情報落ちの実験)
 *****************************************************************************/
public class Kadai5000{
    public static void main(String[] args){
        //double型変数に1億を代入
        double d = 100000000.0;
        
        //1億分の1を1億回加算する
        for(int i = 0; i < 100000000; i++){
            d += 0.000000001;
        }
        
        //加算結果表示
        System.out.println(d);
    }
}
