package a_hensu;

/******************************************************************************
 * 月の足し算
 *****************************************************************************/
public class Kadai4100{
    public static void main(String[] args){
        //月を入力
        int month = Keyboard.readInt("月");
        
        //6ヶ月後を計算。
        //12月の次が0月ではなく1月になるので、
        //5を加算してから年を超えた分を計算し、その後1を加算
        month = (month + 5) % 12 + 1;
        
        //処理結果表示
        System.out.println("6ヶ月後は " + month + "月");
    }
}
