package a_hensu;

/******************************************************************************
 * 四捨五入
 *****************************************************************************/
public class Kadai4000{
    public static void main(String[] args){
        //0以上1未満の小数乱数を生成
        double d = Math.random();
        
        //処理前の値を表示
        System.out.println("四捨五入前の値 = " + d);
        
        //小数点第4位で四捨五入し、小数点第3位までの小数に丸める
        d = (double)(long)(d * 1000.0 + 0.5) / 1000.0;
        
        //処理後の値を表示
        System.out.println("四捨五入後の値 = " + d);
    }
}
