/*******************************************************************************
 * 機雷情報                                                                    *
 *******************************************************************************/
class MineInfo{
    //操作を表す定数
    final static int CLICK = 0;
    final static int CHECK = 1;
    
    private int x;                                                              //x,y座標
    private int y;
    private int manipu;                                                         //Click or Check
    
    /***************************************************************************
     * 座標のみを引数に取るコンストラクタ。操作はクリックになる。
     */
    MineInfo(int x, int y){
        this(x, y, CLICK);
    }
    
    /***************************************************************************
     * 座標および操作を引数に取るコンストラクタ。
     */
    MineInfo(int x, int y, int mani){
        this.x = x;
        this.y = y;
        if(mani < CLICK || mani > CHECK){
            mani = CLICK;
        }
        this.manipu = mani;
    }
    
    /***************************************************************************
     * x座標を取得する
     */
    int getX(){
        return x;
    }
    
    /***************************************************************************
     * y座標を取得する
     */
    int getY(){
        return y;
    }
    
    /***************************************************************************
     * 操作内容を取得する
     */
    int getManipu(){
        return manipu;
    }
}
