#include <iostream>
#include <ctime>
using namespace std;

/**************************************************************************
 * 関数init()：初期化処理
 * 引数：なし
 * 戻値：int サイコロの目
 **************************************************************************/
int init(){
	//乱数初期化
	srand((unsigned)time(NULL));

	return rand() % 6 + 1;
}

/**************************************************************************
 * 関数game()：数当て処理
 * 引数：int num : 正答の数値
 * 戻値：int 当てるまでに回答した数
 **************************************************************************/
int game(int num){
	int count = 0;
	while(1){
		count++;
		int ans;
		cout << "数は？ ";
		cin >> ans;
		if(ans == num){
			cout << "大当たり～！" << endl;
			return count;
		}else if(ans > num){
			cout << "もっと小さい数です。" << endl;
		}else{
			cout << "もっと大きい数です。" << endl;
		}
	}
}

/**************************************************************************
 * 関数end()：終了処理
 * 引数：int num : 当てるまでに回答した数
 * 戻値：なし
 **************************************************************************/
void end(int num){
	cout << "当てるまでに" << num << "回答えました。" << endl;
	if(num < 3){
		cout << "すばらしい！" << endl;
	}else if(num < 5){
		cout << "まあまあでしょう。" << endl;
	}else{
		cout << "もっと頑張りましょう。" << endl;
	}
}

/**************************************************************************
 * サイコロ
 * 関数main()
 **************************************************************************/
int main(){

	//初期処理
	cout << "サイコロを振ります。" << endl;
	cout << "出た目を当ててくださいね。" << endl;
	int num = init();
	cout << endl;
	//入力処理
	num = game(num);
	cout << endl;
	//終了処理
	end(num);
}