/******************************************************************************
 * 大文字小文字変換処理
 *****************************************************************************/
public class Kadai3500{
    public static void main(String[] args){
        //6つのchar型変数にデータを代入
        char c1 = 'N';
        char c2 = 'O';
        char c3 = 'N';
        char c4 = 'T';
        char c5 = 'A';
        char c6 = 'N';
        
        //処理前データの表示
        System.out.println("" + c1 + c2 + c3 + c4 + c5 + c6);
        
        //各変数に32を加算
        c1 += 32;
        c2 += 32;
        c3 += 32;
        c4 += 32;
        c5 += 32;
        c6 += 32;
        
        //処理後データの表示。小文字になるはず
        System.out.println("" + c1 + c2 + c3 + c4 + c5 + c6);
    }
}
