#include <iostream>
#include <ctime>
#include "dice.h"
using namespace std;

/**************************************************************************
 * クラスGame：サイコロを利用したゲーム
 **************************************************************************/
#include "game.h"

//-------------------------------------------------------------------------
//Gameコンストラクタ
//引数：int max : サイコロの最大目
//-------------------------------------------------------------------------
Game::Game(int max){
	if(max < 1){
		max = 6;
	}
	this->max = max;
	count = 0;
}

//-------------------------------------------------------------------------
//Gameコンストラクタ(引数なし)
//引数：なし
//-------------------------------------------------------------------------
Game::Game(){
	Game(6);
}

//-------------------------------------------------------------------------
// 関数guess()：数当て処理
// 引数：なし
// 戻値：なし
//-------------------------------------------------------------------------
void Game::guess(){
	Dice d(max);

	while(1){
		count++;
		int ans;
		cout << "数は？ ";
		cin >> ans;
		ans = d.compNum(ans);
		switch(ans){
			case -1:
				cout << "もっと小さい数です。" << endl;
				break;
			case 0:
				cout << "大当たり～！" << endl;
				return;
			case 1:
				cout << "もっと大きい数です。" << endl;
				break;
		}
	}
}

//-------------------------------------------------------------------------
// 関数end()：終了処理
// 引数：なし
// 戻値：なし
//-------------------------------------------------------------------------
void Game::end(){
	cout << "当てるまでに" << count << "回答えました。" << endl;
	if(count < (max / 3 + 1)){
		cout << "すばらしい！" << endl;
	}else if(count < (max * 2 / 3 + 1)){
		cout << "まあまあでしょう。" << endl;
	}else{
		cout << "もっと頑張りましょう。" << endl;
	}
}

//-------------------------------------------------------------------------
// 関数start() : ゲーム開始処理
// 引数：なし
// 戻値：なし
//-------------------------------------------------------------------------
void Game::start(){
	//初期処理
	cout << "サイコロを振ります。" << endl;
	cout << "出た目を当ててくださいね。" << endl;
	cout << endl;
	//入力処理
	guess();
	cout << endl;
	//終了処理
	end();
}