package j_method;
public class Kadai5010{
    public static void main(String[] args){
        //迷路の定義
        char[][] maze = {
            {'■','■','■','■','■','■','■','■','■','■','■','■','■','■','■','■','■','■','■','■','■'},
            {'■','　','　','　','　','　','　','　','　','　','　','　','　','　','　','　','　','　','　','　','■'},
            {'■','　','■','■','■','■','■','■','■','■','■','■','■','■','■','　','■','■','■','■','■'},
            {'■','　','　','　','　','　','　','　','　','　','　','　','　','　','■','　','■','　','　','　','■'},
            {'■','■','■','■','■','■','■','　','■','■','■','■','■','　','■','　','■','　','■','　','■'},
            {'■','　','　','　','　','　','　','　','　','　','　','　','■','　','■','　','■','　','■','　','■'},
            {'■','■','■','　','■','■','■','■','■','■','■','　','■','　','■','　','■','　','■','　','■'},
            {'■','　','■','　','■','　','　','　','　','　','■','　','■','　','■','　','■','　','■','　','■'},
            {'■','　','■','　','■','　','■','■','■','　','■','　','■','　','■','　','■','■','■','　','■'},
            {'■','　','　','　','■','　','■','　','■','　','■','　','■','　','■','　','　','　','　','　','■'},
            {'■','■','■','■','■','　','■','　','■','　','■','　','■','　','■','■','■','　','■','■','■'},
            {'■','　','　','　','　','　','■','　','■','　','■','　','■','　','■','　','■','　','■','　','■'},
            {'■','　','■','■','■','■','■','　','■','　','■','　','■','　','■','　','■','　','■','　','■'},
            {'■','　','■','　','　','　','　','　','■','　','■','　','■','　','■','　','■','　','■','　','■'},
            {'■','　','■','　','■','■','■','■','■','　','■','■','■','　','■','　','■','　','■','　','■'},
            {'■','　','■','　','　','　','　','　','■','　','　','　','　','　','■','　','■','　','■','　','■'},
            {'■','　','■','　','■','■','■','　','■','■','■','■','■','■','■','　','■','　','■','　','■'},
            {'■','　','■','　','■','　','■','　','　','　','■','　','　','　','　','　','■','　','　','　','■'},
            {'■','　','■','　','■','　','■','■','■','■','■','　','■','■','■','　','■','■','■','■','■'},
            {'■','　','　','　','　','　','　','　','　','　','　','　','■','　','　','　','　','　','　','　','■'},
            {'■','■','■','■','■','■','■','■','■','■','■','■','■','■','■','■','■','■','■','■','■'}
        };
        
        final int START_R = 19;
        final int START_C = 1;
        final int GOAL_R = 1;
        final int GOAL_C = 19;
        
        //現在値や経路スタックの初期化
        int posR = START_R;   //現在座標:行
        int posC = START_C;   //現在座標:列
        int direc = 0;        //現在向き(0:上, 1:右, 2:下, 3:左)
        
        IntStack2 pathR = new IntStack2();  //経路(行)
        IntStack2 pathC = new IntStack2();  //経路(列)
        
        //迷路探索
        while(posR != GOAL_R || posC != GOAL_C){
            //  行動判断(0:左向前進, 1:前進, 2:右向)
            int move = judgeMotion(maze, posR, posC, direc);
            
            //  行動
            switch(move){
            case 0: //左向き
                direc = (direc + 3) % 4;
            case 1: //前進
                int[] newPos = forward(pathR, pathC, posR, posC, direc);
                posR = newPos[0];
                posC = newPos[1];
                break;
            case 2: //右向き
                direc = (direc + 1) % 4;
                break;
            }
        }
        
        //ゴール
        pathR.push(posR);
        pathC.push(posC);
        
        int cnt = pathR.getCount();
        for(int i = 0; i < cnt; i++){
            posR = pathR.pop();
            posC = pathC.pop();
            maze[posR][posC] = '・';
        }
        
        //経路の表示
        for(int r = 0; r < maze.length; r++){
            for(int c = 0; c < maze[r].length; c++){
                System.out.print(maze[r][c]);
            }
            System.out.println();
        }
    }
    
    /**
     * 行動判断
     *
     * 引数 : maze:迷路配列, posR:現在座標(行), posC:現在座標(列),
     *        direc:向き(0:上, 1:右, 2:下, 3:左)
     * 戻値 : 0:左向前進, 1:前進, 2:右向
     */
    private static int judgeMotion(char[][] maze, int posR, int posC, int direc){
        int lr = (direc % 2) * (direc - 2) + posR;        //左隣の行
        int lc = ((direc + 1) % 2) * (direc - 1) + posC;  //左隣の列
        int fr = ((direc + 1) % 2) * (direc - 1) + posR;  //前の行
        int fc = (direc % 2) * (2 - direc) + posC;        //前の列
        
        if(maze[lr][lc] == '　'){
            return 0;  //左壁ないなら左向いて前進
        }else if(maze[fr][fc] == '　'){
            return 1;  //左壁あって前壁ないなら前進
        }
        return 2;      //左壁も前壁もあるなら右向き
    }
    
    /**
     * 前進処理
     *
     * 引数 : pathR:経路(行), pathC:経路(列), posR:現在座標(行), posC:現在座標(列),
     *        direc:向き(0:上, 1:右, 2:下, 3:左)
     * 戻値 : 前進後の座標(添字0:行, 添字1:列)
     */
    private static int[] forward(IntStack2 pathR, IntStack2 pathC, int posR, int posC, int direc){
        int dr = ((direc + 1) % 2) * (direc - 1); //行の増減を計算
        int dc = (direc % 2) * (2 - direc);       //列の増減を計算
        
        int[] newPos = new int[2];
        newPos[0] = posR + dr;
        newPos[1] = posC + dc;
        
        if(pathR.get() == newPos[0] && pathC.get() == newPos[1]){
            pathR.pop();                          //来た道戻るならpop
            pathC.pop();
        }else{
            pathR.push(posR);                     //初めての道ならpush
            pathC.push(posC);
        }
        return newPos;
    }
}
