package j_method;
/******************************************************************************
 * 引数の基本型・参照型
 *****************************************************************************/
public class Kadai1310{
    
    /**************************************************************************
     * メインメソッド
     *************************************************************************/
    public static void main(String[] args){
        int a = 8;
        int[] b = new int[1];
        b[0] = 8;
        
        System.out.println("呼出し側・メソッド呼び出し前");
        System.out.printf("a = %d, b[0] = %d\n", a, b[0]);
        test(a, b);
        System.out.println("呼出し側・メソッド呼び出し後");
        System.out.printf("a = %d, b[0] = %d\n", a, b[0]);
    }
    
    /**************************************************************************
     * 引数に値を代入する
     * 
     * 引数 : a int型引数, b int配列型引数
     * 戻値 : なし
     *************************************************************************/
    private static void test(int a, int[] b){
        System.out.println("呼出され側・値代入前");
        System.out.printf("a = %d, b[0] = %d\n", a, b[0]);
        a = 5;
        b[0] = 5;
        System.out.println("呼出され側・値代入後");
        System.out.printf("a = %d, b[0] = %d\n", a, b[0]);
    }
}
