package j_method;
/******************************************************************************
 * コンピュータとプレイヤーがじゃんけんするプログラム
 *****************************************************************************/
public class Kadai1110{
    
    /**************************************************************************
     * メインメソッド
     *************************************************************************/
    public static void main(String[] args){
        //最初の表示
        showInitMessage();
        
        //コンピュータの手を決める
        int comp = makeCompHand();
        
        //プレイヤーの手を決める
        int player = inputPlayerHand();
        
        //手を表示する
        showHand("コンピュータ", comp);
        showHand("あなた", player);
        
        //勝敗判定
        int win = judge(player, comp);
        
        //勝敗表示
        showResult(win);
    }
    
    /**************************************************************************
     * じゃんけんの最初の画面表示を行う
     *
     * 引数 : なし
     * 戻値 : なし
     *************************************************************************/
    public static void showInitMessage(){
        System.out.println("これからじゃんけんをします。");
        System.out.println("じゃんけんの手を決めてください。");
        System.out.println();
    }
    
    /**************************************************************************
     * コンピュータの手を決める。乱数により、0～3の整数値を返す。
     * 
     * 引数 : なし
     * 戻値 : 0 グー, 1 チョキ, 2 パー
     *************************************************************************/
    public static int makeCompHand(){
        return (int)(Math.random() * 3.0);
    }
    
    /**************************************************************************
     * プレイヤーの手を決める。キーボード入力により、0～3の整数値を返す。
     * 
     * 引数 : なし
     * 戻値 : 0 グー, 1 チョキ, 2 パー, -1 異常
     ************************************************************************/
    public static int inputPlayerHand(){
        int p = Keyboard.readInt("手[0:グー, 1:チョキ, 2:パー]");
        if(p < 0 || p > 2){
            p = -1;
        }
        return p;
    }
    
    /**************************************************************************
     * 勝敗判定をする。判定の結果を戻り値で戻す。
     * 
     * 引数 : p プレイヤーの手   (-1 異常, 0 グー, 1 チョキ, 2 パー)
     *        c コンピュータの手 (0 グー, 1 チョキ, 2 パー)
     * 戻値 : -1 勝敗判定できず
     *         0 プレイヤーの勝ち 
     *         1 あいこ
     *         2 コンピュータの勝ち
     *************************************************************************/
    public static int judge(int p, int c){
        //プレイヤーの手が異常ならば、判定不能
        if(p == -1){
            return -1;
        }
        
        //勝敗決定表 result[プレイヤー手][コンピュータ手]
        int[][] result = {
            { 1, 0, 2},
            { 2, 1, 0},
            { 0, 2, 1}
        };
        return result[p][c];
    }
    
    /**************************************************************************
     * 手を表示する。
     * 
     * 引数 : name 手を出した者の表記名
     *        hand 手の種類(0 グー, 1 チョキ, 2 パー, -1 異常)
     * 戻値 : なし
     *************************************************************************/
    public static void showHand(String name, int hand){
        System.out.print(name + "の手は");
        switch(hand){
        case 0:
            System.out.println("グー");
            break;
        case 1:
            System.out.println("チョキ");
            break;
        case 2:
            System.out.println("パー");
            break;
        default:
            System.out.println("不正です。");
        }
    }
    
    /**************************************************************************
     * 勝敗表示を行う。
     * 
     * 引数 : result 勝敗結果(judge()メソッドの戻り値に従う)
     * 戻値 : なし
     *************************************************************************/
    public static void showResult(int result){
        System.out.println();
        switch(result){
        case 0:
            System.out.println("あなたの勝ちです！");
            break;
        case 1:
            System.out.println("あいこです。");
            break;
        case 2:
            System.out.println("あなたの負けです。");
            break;
        default:
            System.out.println("判定できません。");
        }
    }
}
