package j_method;
/******************************************************************************
 * サブルーチンとしてのメソッド ～ 素因数分解
 * ある整数が素数かどうかを調べるメソッド
 *****************************************************************************/
public class Kadai1010{
    
    /**************************************************************************
     * メインメソッド
     *************************************************************************/
    public static void main(String[] args){
        //整数の入力
        int num = Keyboard.readInt("整数");
        
        //素数か非素数かの表示
        if(isPrime(num)){
            System.out.println("素数");
        }else{
            System.out.println("非素数");
        }
    }
    
    /**************************************************************************
     * 整数が素数か非素数かを調べる
     * 
     * 引数 : num 素数か非素数かを調べる整数
     * 戻値 : true 素数, false 非素数
     *************************************************************************/
    private static boolean isPrime(int num){
        //整数が2未満は非素数
        if(num < 2){
            return false;
        }
        
        //素数か非素数かを調べる
        boolean prime = true;
        if(num != 2 && num % 2 == 0){
            //整数が偶数なら非素数
            prime = false;
        }else{
            //整数が奇数の場合は、3～整数の平方根までの奇数のうち、
            //割り切れる数があれば非素数
            int max = (int)(Math.sqrt((double)num)) + 1;
            for(int i = 3; i < max && prime; i += 2){
                if(num % i == 0){
                    prime = false;
                }
            }
        }
        
        //最終的に、非素数でなければ素数である
        return prime;
    } 
}
