/*******************************************************************************
 * 足し算問題を扱うクラス
 ******************************************************************************/
class Add{
    private static final int MIN = 1;             //問題に使う数の最小値
    private static final int MAX = 9;             //問題に使う数の最大値
    
    private int a;                                //問題の数値a
    private int b;                                //問題の数値b
    
    /***************************************************************************
     * 問題を作る
     *
     * 引　数：なし
     * 戻り値：なし
     * その他：a,bを更新する
     **************************************************************************/
    public void makeQuestion(){
        a = (int)(Math.random() * (MAX - MIN + 1)) + MIN;
        b = (int)(Math.random() * (MAX - MIN + 1)) + MIN;
    }
    
    /***************************************************************************
     * 問題を表示する
     *
     * 引　数：i 問題番号(0から開始)
     * 戻り値：なし
     * その他：なし
     **************************************************************************/
    public void showQuestion(int i){
        System.out.print("[第" + (i + 1) + "問] ");
        System.out.print(a + " ＋ " + b + " ＝ ");
    }
    
    /***************************************************************************
     * 正誤を判定する
     *
     * 引　数：ans 回答値
     * 戻り値：正誤(正:1, 誤:0)
     * その他：
     **************************************************************************/
    public int judge(int ans){
        int correct = 0;
        if(ans == a + b){
            correct = 1;
            System.out.println("正解！");
        }else{
            System.out.println("まちがい。。。");
        }
        return correct;
    }
}
