package j_method;
/******************************************************************************
 * クラスIntQueue
 * 
 * int型データを保持するキュー
 *****************************************************************************/
public class IntQueue{
    
    private final int SIZE = 20;         //キューのサイズ
    private int[] queue = new int[SIZE]; //データ格納用配列
    private int start = 0;               //格納データの先頭添字
    private int count = 0;               //格納データ数
    
    /**************************************************************************
     * キューにint型データを入れる
     * 
     * 引数 : dat キューに入れるデータ
     * 戻値 : datを入れた後のデータ数 (キューが満杯で入れられなかった場合は-1)
     *************************************************************************/
    public int enqueue(int dat){
        //キュー内のデータ数チェック
        if(count >= SIZE){
            return -1;
        }
        //キューにデータを入れる
        queue[(start + count) % SIZE] = dat; //最後の添字の次は先頭の添字
        count++;
        return count;
    }
    
    /**************************************************************************
     * キューからint型データを取り出す
     * 
     * 引数 : なし
     * 戻値 : 取り出したデータ (キューが空だった場合はint型最小値)
     *************************************************************************/
    public int dequeue(){
        //キュー内のデータ数チェック
        if(count <= 0){
            return Integer.MIN_VALUE;
        }
        //キューからデータを取り出す
        int dat = queue[start];
        start = ++start % SIZE;              //最後の添字の次は先頭の添字
        count--;
        return dat;
    }
    
    /**************************************************************************
     * 次にキューから取り出されるデータを得る
     * キューからは取り出さず、データのコピーが得られる
     * 
     * 引数 : なし
     * 戻値 : 得られたデータ (キューが空だった場合はint型最小値)
     *************************************************************************/
    public int get(){
        //キュー内のデータ数チェック
        if(count <= 0){
            return Integer.MIN_VALUE;
        }
        //キューの先頭のデータを返す
        return queue[start];
    }
    
    /**************************************************************************
     * キューに格納されているデータの数を得る
     * 
     * 引数 : なし
     * 戻値 : キュー内のデータ数
     *************************************************************************/
    public int getCount(){
        return count;
    }
    
    /**************************************************************************
     * キューのデータを全てクリアする
     * 
     * 引数 : なし
     * 戻値 : なし
     *************************************************************************/
    public void clear(){
        start = 0;
        count = 0;
    }
}
