/******************************************************************************
 * クラスAddition
 * 　足し算問題を出題するクラス
 ******************************************************************************/
#include <iostream>
#include "Addition.h"
using namespace std;

/******************************************************************************
 * 関数showNextQuestion()
 * 　新しい問題を表示する。
 * 引数：なし
 * 戻値：なし
 ******************************************************************************/
void Addition::showNextQuestion(){
	x = rand() % 10;						//数値は0～9
	y = rand() % 10;
	answer = x + y;							//正答は2桁OK
	cout << x << " + " << y << " = ? ";		//表示(隣に入力のため、改行なし)
}
