/******************************************************************************
 * クラスDivision
 * 　割り算問題を出題するクラス
 ******************************************************************************/
#include <iostream>
#include "Division.h"
using namespace std;

/******************************************************************************
 * 関数showNextQuestion()
 * 　新しい問題を表示する。
 * 引数：なし
 * 戻値：なし
 ******************************************************************************/
void Division::showNextQuestion(){
	y = rand() % 9 + 1;						//数値2は1～9
	answer = rand() % 10;					//正答は0～9
	x = y * answer;							//割切れる問題のみ出題
	cout << x << " / " << y << " = ? ";
}
