/******************************************************************************
 * クラスMultiplication
 * 　掛け算問題を出題するクラス
 ******************************************************************************/
#include <iostream>
#include "Multiplication.h"
using namespace std;

/******************************************************************************
 * 関数showNextQuestion()
 * 　新しい問題を表示する。
 * 引数：なし
 * 戻値：なし
 ******************************************************************************/
void Multiplication::showNextQuestion(){
	x = rand() % 10;						//数値は0～9
	y = rand() % 10;
	answer = x * y;
	cout << x << " * " << y << " = ? ";
}
