/******************************************************************************
 * クラスQuestionWithRank
 * 　計算ゲームの問題種別とランキングを関連付けるクラス
 ******************************************************************************/
#include "QuestionWithRank.h"

/******************************************************************************
 * コンストラクタ
 * 　メンバ初期化
 * 引数：なし
 ******************************************************************************/
QuestionWithRank::QuestionWithRank(Question &qe){
	question = &qe;
	ranking = new Ranking();
}
/******************************************************************************
 * デストラクタ
 * 　ヒープ上のオブジェクト開放
 * 引数：なし
 ******************************************************************************/
QuestionWithRank::~QuestionWithRank(){
	delete ranking;
}

/******************************************************************************
 * 関数addScore()
 * 　スコアをランキングに追加する。(Rankingへ委譲)
 * 引数：Score &sc : 追加するスコアオブジェクト
 * 戻値：int ランクイン:1 ランク外:0
 ******************************************************************************/
int QuestionWithRank::addScore(Score &sc){
	return ranking->addScore(sc);
}

/******************************************************************************
 * 関数showRanking()
 * 　ランキングを表示する。(Rankingへ委譲)
 * 引数：なし
 * 戻値：なし
 ******************************************************************************/
void QuestionWithRank::showRanking(){
	ranking->showRanking();
}

/******************************************************************************
 * 関数showNextQuestion()
 * 　新しい問題を表示する。(Questionのサブオブジェクトへ委譲)
 * 引数：なし
 * 戻値：なし
 ******************************************************************************/
void QuestionWithRank::showNextQuestion(){
	question->showNextQuestion();
}

/******************************************************************************
 * 関数isRightAnser()
 * 　引数が、現在の問題の正答であるか否かを調べる。(Questionへ委譲)
 * 引数：int ans : 調べる回答
 * 戻値：int 正答:1, 誤答:0
 ******************************************************************************/
int QuestionWithRank::isRightAnswer(int ans){
	return question->isRightAnswer(ans);
}
