/******************************************************************************
 * クラスQuestion
 * 　計算問題を出題するクラスの基底抽象クラス。
 ******************************************************************************/
#include <ctime>
#include <iostream>
#include "Question.h"
using namespace std;

/******************************************************************************
 * コンストラクタ
 * 　メンバ初期化と乱数列初期化
 * 引数：なし
 ******************************************************************************/
Question::Question(){
	srand((unsigned)time(NULL));	//乱数列初期化
	x = 0;							//ひとまず全メンバ0
	y = 0;
	answer = 0;
}

/******************************************************************************
 * 関数isRightAnser()
 * 　引数が、現在の問題の正答であるか否かを調べる。
 * 引数：int ans : 調べる回答
 * 戻値：int 正答:1, 誤答:0
 ******************************************************************************/
int Question::isRightAnswer(int ans){
	if(ans == answer){
		return 1;							//一致していれば真(正答)
	}
	return 0;								//そうでなければ偽(誤答)
}