/******************************************************************************
 * クラスRanking
 * 　計算ゲームのランキングを表すクラス
 ******************************************************************************/
#include <iostream>
#include "Ranking.h"
using namespace std;

/******************************************************************************
 * コンストラクタ
 * 　メンバ初期化
 * 引数：なし
 ******************************************************************************/
Ranking::Ranking(){
	for(int i = 0; i < MAX + 1; i++){
		rank[i] = NULL;
	}
}

/******************************************************************************
 * 関数addScore()
 * 　スコアをランキングに追加する。
 * 引数：Score &sc : 追加するスコアオブジェクト
 * 戻値：int ランク、ランク外の場合:0
 ******************************************************************************/
int Ranking::addScore(Score &sc){
	int i = 0;
	for(i = MAX - 1; i > -1; i--){		//追加するスコアを挿入ソートする。
										//(MAX+1)位になったスコアは捨てられる。
		if( (rank[i] == NULL) || (sc.compScore(*rank[i])) ){
			rank[i + 1] = rank[i];		//１つずつ比較して、勝つ度に
		}else{							//　　　　　相手のランクを下げる。
			break;						//負けたところでbreak;
		}
	}
	rank[i + 1] = &sc;					//相手に負けたところが、自分の入る場所

	if(i == MAX - 1){
		return 0;						//自分が(MAX+1)位ならランク外
	}
	return i + 2;						//ランクインしたら順位を返す
}

/******************************************************************************
 * 関数showRanking()
 * 　ランキングを表示する。
 * 引数：なし
 * 戻値：なし
 ******************************************************************************/
void Ranking::showRanking(){
	for(int i = 0; i < MAX; i++){
		if(rank[i] != NULL){
			int r = i + 1;						//順位
			char *na = rank[i]->getName();		//名前
			float sc = rank[i]->getScore();		//スコア
			printf("第%2d位 %-20s %.2f\n", r, na, sc);
		}
	}
}
