/******************************************************************************
 * クラスScore
 * 　計算ゲームのスコアを表すクラス
 ******************************************************************************/
#include <cmath>
#include <iostream>
#include "Score.h"
using namespace std;

/******************************************************************************
 * コンストラクタ
 * 　メンバ初期化
 * 引数：なし
 ******************************************************************************/
Score::Score(){
	score = -1.0;			//スコア無し
	name = new char[20];	//名前文字列エリア
}

/******************************************************************************
 * デストラクタ
 * 　名前メンバの解放
 * 引数：なし
 ******************************************************************************/
Score::~Score(){
	delete name;
}

/******************************************************************************
 * 関数calcScore()
 * 　スコアを計算する。
 * 引数：int play_t     : 回答時間(秒)
 * 　　　int right_cnt  : 正答数
 * 　　　int total_ques : 総問題数
 * 戻値：float スコア
 ******************************************************************************/
float Score::calcScore(int play_t, int right_cnt, int total_ques){
	//回答時間に、誤答１回あたり2秒のペナルティを加算
	float calc_t = (float)( (total_ques - right_cnt) * 2 + play_t );
	
	//スコア＝回答時間÷正答数
	score = calc_t / (float)right_cnt;

	//スコアの小数第3位切り捨て
	score = floor(score * 100.0f) / 100.0f;

	return score;
}

/******************************************************************************
 * 関数inputName()
 * 　名前を入力する。
 * 引数：なし
 * 戻値：char * 入力された名前文字列ポインタ
 ******************************************************************************/
char *Score::inputName(){
	cin >> name;
	return name;
}

/******************************************************************************
 * 関数compScore()
 * 　他のスコアと比較する
 * 引数：Score &mate : 比較するスコアオブジェクト
 * 戻値：int 比較結果　自分が負けor同点:0 自分が勝ち:1
 ******************************************************************************/
int Score::compScore(Score &mate){
	if(mate.score == -1){				//相手がスコア無しの場合
		return 1;						//自分が勝ち
	}
	if(score >= mate.score){			//自分のスコアが大きい
		return 0;						//自分の負け
	}
	return 1;							//負けてなければ勝ち
}

/******************************************************************************
 * 関数getScore()
 * 　スコアを得る
 * 引数：なし
 * 戻値：float スコア
 ******************************************************************************/
float Score::getScore(){
	return score;
}

/******************************************************************************
 * 関数getName()
 * 　名前を得る
 * 引数：なし
 * 戻値：char * 名前文字列ポインタ
 ******************************************************************************/
char *Score::getName(){
	return name;
}
