/******************************************************************************
 * クラスSubtraction
 * 　引き算問題を出題するクラス
 ******************************************************************************/
#include <iostream>
#include "Subtraction.h"
using namespace std;

/******************************************************************************
 * 関数showNextQuestion()
 * 　新しい問題を表示する。
 * 引数：なし
 * 戻値：なし
 ******************************************************************************/
void Subtraction::showNextQuestion(){
	x = rand() % 10;						//数値は0～9
	y = rand() % 10;
	if(x < y){								//正答が負にならぬよう、
		int w = x;							//x<yなら値交換
		x = y;
		y = w;
	}
	answer = x - y;
	cout << x << " - " << y << " = ? ";
}
