import java.awt.Graphics; //グラフィックス描画機能クラス
import java.awt.Color;    //色クラス

/*******************************************************************************
 * 玉打遊戯のバー。
 *
 * @author 山田　洋 2008/5/1
 ******************************************************************************/
public class Bar{
    private int x;         //バー中央のx座標
    private int y;         //バー中央のy座標
    private int width;     //バーの幅
    private Color color;   //バーの色
    
    /***************************************************************************
     * バーの座標を決定する。コンストラクタ。
     **************************************************************************/
    public Bar(){
        x = 0;                                            //ひとまず原点に配置
        y = 0;
        width = 100;                                      //幅100ドット
        color = Color.BLUE;                               //色は青
    }
    
    /***************************************************************************
     * バーを描画する。
     *
     * @param g 描画するグラフィックオブジェクト
     **************************************************************************/
    public void draw(Graphics g){
        g.setColor(color);                                //描画色の指定
        g.drawLine(x - width / 2, y, x + width / 2, y);   //直線の描画
    }
    
    /***************************************************************************
     * バーの移動。
     *
     * @param x 移動先x座標
     * @param y 移動先y座標
     **************************************************************************/
    public void move(int x, int y){
        this.x = x;
        this.y = y;
    }
    
    /***************************************************************************
     * バーのx座標を得る。
     *
     * @return バー中心のx座標
     **************************************************************************/
    public int getX(){
        return x;
    }
    
    /***************************************************************************
     * バーのy座標を得る。
     *
     * @return バー中心のy座標
     **************************************************************************/
    public int getY(){
        return y;
    }
    
    /***************************************************************************
     * バーの幅を得る。
     *
     * @return バーの幅ドット数
     **************************************************************************/
    public int getWidth(){
        return width;
    }
}
