/*******************************************************************************
 * 玉打遊戯のタイマー
 *
 * @author 山田　洋 2008/5/1
 ******************************************************************************/
public class Timer extends Thread{
    private TamaUchiGamePanel panel; //玉打遊戯パネルの参照
    private int sleeptime;           //待ち時間
    
    /***************************************************************************
     * 待ち時間の設定を行う。コンストラクタ。
     *
     * @param panel 玉打遊戯パネルの参照
     * @param fps   1秒あたりの描画フレーム数(厳密でない)
     **************************************************************************/
    public Timer(TamaUchiGamePanel panel, int fps){
        this.panel = panel;
        sleeptime = 1000 / fps;               //fpsから1描画フレームあたりの待ち時間[ms]を計算
    }
    
    /***************************************************************************
     * 時間カウントをする。
     **************************************************************************/
    public void run(){
        while(true){
            try{
                Thread.sleep(sleeptime);      //待ち
            }catch(InterruptedException e){
                System.out.println(e);
            }
            panel.move();                     //パネルに対し遊戯要素移動を要求
            panel.repaint();                  //パネルに対し再描画を要求
        }
    }
}
