/******************************************************************************
 * じゃんけんの手を表すクラス
 ******************************************************************************/
public class Hand{
  //-手の種類(0:グー, 1:チョキ, 2:パー)----------------------------------------
  private int index2 = 0;
  
  //---------------------------------------------------------------------------
  // 手の種類を設定する
  //   引数：設定する手の種類の候補(0:グー, 1:チョキ, 2:パー)
  //   戻値：実際に設定された手の種類(0:グー, 1:チョキ, 2:パー)
  //---------------------------------------------------------------------------
  public int setHand(int index){
      if(-1 < index && index < 3){
          index2 = index;
      }
      return index2;
  }
  
  //---------------------------------------------------------------------------
  // 手の種類を得る
  //   引数：なし
  //   戻値：手の種類(0:グー, 1:チョキ, 2:パー)
  //---------------------------------------------------------------------------
  public int getHand(){
      return index2;
  }
  
  //---------------------------------------------------------------------------
  // 勝敗判定
  //   引数：rivalHand 相手の手
  //   戻値：判定結果(0:あいこ, 1:自分の勝ち, 2:自分の負け)
  //---------------------------------------------------------------------------
  public int check(Hand rivalHand) {
    int index1 = rivalHand.getHand();
    
    int r = 0; // aiko 0 you win 1 you lost 2
    if(index1 == index2) r = 0;
    else if(index1 == 0) {
      if(index2 == 2) r = 1;
      else r = 2;
    }
    else if(index1 == 1) {
      if(index2 == 0) r = 1;
      else r = 2;
    }
    else if(index1 == 2) {
      if(index2 == 1) r = 1;
      else r = 2;
    }
    return r;
  }
}
