/******************************************************************************
 * 文字を繰り返し表示
 *****************************************************************************/
public class Kadai1720{
    public static void main(String[] args){
        //1行の表示を10回繰り返す
        for(int l = 0; l < 10; l++){
            //1行の表示(*の表示を50回繰り返す)
            for(int i = 0; i < 50; i++){
                System.out.print('*');     //*の表示
            }
            System.out.println();          //改行
        }
    }
}
